HELYXcore-4.4.0/modules/swak4Foam/Examples/groovyBC/multiRegionHeaterFeedback/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii; 	
 class dictionary; 	
 object blockMeshDict; 	
}

convertToMeters 1;

vertices
  (
    (-0.1 -0.04 -0.05)
    (0.1 -0.04 -0.05)
    (0.1 0.04 -0.05)
    (-0.1 0.04 -0.05)
    (-0.1 -0.04 0.05)
    (0.1 -0.04 0.05)
    (0.1 0.04 0.05)
    (-0.1 0.04 0.05)
  ); 	

blocks
  (
    hex

    (
      0
      1
      2
      3
      4
      5
      6
      7
    )
    (31 10 10)
    simpleGrading
    (1 1 1)
  ); 	

edges
  (
  ); 	

patches
  (
    wall
    maxY

    (

      (
        3
        7
        6
        2
      )
    )
    patch
    minX

    (

      (
        0
        4
        7
        3
      )
    )
    patch
    maxX

    (

      (
        2
        6
        5
        1
      )
    )
    wall
    minY

    (

      (
        1
        5
        4
        0
      )
    )
    wall
    minZ

    (

      (
        0
        3
        2
        1
      )
    )
    wall
    maxZ

    (

      (
        4
        5
        6
        7
      )
    )
  ); 	

mergePatchPairs
  (
  ); 	

boundary
  (
    maxY

    {
      faces
        (

          (
            3
            7
            6
            2
          )
        );
      type wall;

    }
    minX

    {
      faces
        (

          (
            0
            4
            7
            3
          )
        );
      type patch;

    }
    maxX

    {
      faces
        (

          (
            2
            6
            5
            1
          )
        );
      type patch;

    }
    minY

    {
      faces
        (

          (
            1
            5
            4
            0
          )
        );
      type wall;

    }
    minZ

    {
      faces
        (

          (
            0
            3
            2
            1
          )
        );
      type wall;

    }
    maxZ

    {
      faces
        (

          (
            4
            5
            6
            7
          )
        );
      type wall;

    }
  );

