HELYXcore-4.4.0/modules/swak4Foam/Examples/groovyBC/multiRegionHeaterFeedback/system/README
fvSolution is used for outer correctors specification.
fvSchemes is only so that pre-processing activities can proceed

